Обработки/Reports/_ОтчетОДоходахИРасходахСбербанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахСбербанк</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахСбербанк/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьОтчетНаСервере()
	
	РеквизитФормыВЗначение("Отчет").Сформировать(Результат, Расшифровка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьОтчетНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеФормирование() Экспорт
	Перем Отказ;
	
	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Отчет.Руководитель = ЭтаФорма.НастройкиОтчета.ПодписантРуководитель;
	Отчет.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьОтчетНаСервере();
		РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНеактуальностьРезультата()
	
	Элементы.Результат.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Отчет.Руководитель));		
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Отчет.Подписант));	
	ИначеЕсли Элемент.Имя = "ПодписантОтКлиента" Тогда	
		ЮрЛицо = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(Отчет.СчетДоверительногоУправления, Отчет.Период.ДатаОкончания);
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, Объект, КонтактноеЛицо", Отчет.Организация, ЮрЛицо, Отчет.ПодписантОтКлиента));			
	КонецЕсли;	
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;	
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантОтКлиента" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантОтКлиента", СтруктураДанныхКонтактногоЛица);			
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	Если Элемент.Имя = "ПодписантРуководитель" Тогда 
		Если НЕ ЗначениеЗаполнено(Отчет.Руководитель) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", Неопределено);	
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Если НЕ ЗначениеЗаполнено(Отчет.Подписант) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", Неопределено);	
		КонецЕсли;	
	ИначеЕсли Элемент.Имя = "ПодписантОтКлиента" Тогда
		Если НЕ ЗначениеЗаполнено(Отчет.ПодписантОтКлиента) Тогда
			Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантОтКлиента", Неопределено);	
		КонецЕсли;			
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаНастроекНаСервере()
	
	РеквизитФормыВЗначение("Отчет").ПроверкаНастроек(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНастроек(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда		
		ПроверкаНастроекНаСервере();
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат);
	КонецЕсли;	
	
КонецПроцедуры
